{
"Аутентификация" : "процесс проверки принадлежности субъекту прав доступа к информационным ресурсам системы или веб-сайта в соответствии с предъявленным им идентификатором; подтверждение (установление) подлинности субъекта."
"Субъект": "это тот, кто проходит аутентификацию (авторизированный пользователь)."
"Характеристика субъекта" : "идентификатор, который он предъявляет для проверки подлинности."
"Владелец системы аутентификации" : "хозяин информационного ресурса или веб-сайта."
"Механизм аутентификации" : "ПО, которое проверяет подлинность предъявленного идентификатора."
"Механизм авторизации" : "предоставление или лишение субъекта прав доступа после успешной или безуспешной аутентификации."
"Парольные методы" : "наиболее распространенные методы аутентификации, основанные на секретных характеристиках субъектов — паролях. В процессе проверки подлинности система сравнивает указный пользователем пароль с эталонным паролем, который хранится в ее БД в зашифрованном виде. Для аутентификации посредством данного метода могут использоваться постоянные (многоразовые, неизменные для каждой сессии) или динамические (одноразовые, постоянно меняющиеся для каждой сессии) пароли."
"Комбинированные метод" : "сущность данного метода заключается в использовании для подтверждения подлинности субъекта помимо пароля дополнительных предметов (мобильных телефонов, смарт-карт, токенов) или атрибутов (криптографических сертификатов). Авторизация при помощи предметов и атрибутов субъекта происходит только при наличии специального устройства, которое может считывать информацию с перечисленных идентификаторов."
"Биометрические методы" : "для аутентификации посредством биометрического метода субъекты должны пройти сканирование и анализ одного или нескольких физиологических (отпечатки пальцев, радужная оболочка глаза, сетчатка глаза, кисть руки, черты лица) или поведенческих характеристик (подпись, тембр голоса, клавиатурный почерк). Данный метод, как правило, используется только на особо важных объектах и системах, так как требует наличия специальной дорогостоящей техники и оборудования."
"Информация о пользователе" : "она используется для восстановления логина или пароля и для двухэтапной аутентификации, чтобы обеспечить безопасность. К этому методу относится номер телефона, девичья фамилия матери, год рождения, дата регистрации, кличка питомца, место проживания."
"Пользовательские данные" : "этот метод основывается на геоданных о местоположении пользователя с использованием GPS, а также использует информацию о точках доступа беспроводной связи. Недостаток заключается в том, что с помощью прокси-серверов можно подменить данные."
"Односторонняя проверка подлинности" : "субъект доказывает владельцу системы свои права доступа к информационным ресурсам или интернет-сайту."
"Двусторонняя аутентификация" : "обоюдная проверка и установление подлинности как субъекта, так и владельца системы."
"Статическая аутентификация" : "защищает от несанкционированного доступа злоумышленников, которые могут завладеть данными об идентификаторе пользователя во время его работы с информационным ресурсом или сайтом. Как правило, в основе статической аутентификации лежит парольный метод."
"Устойчивая" : "служит для предотвращения перехвата идентификатора с целью использования его в следующих сеансах работы, но не защищает от активных атак, во время которых злоумышленник успевает быстро завладеть идентификатором и модифицировать его. Механизм устойчивой аутентификации основан на использовании динамических идентификаторов, которые меняются перед каждым сеансом."
"Постоянная" : "защищает субъекта от несанкционированной кражи и модификации его идентификатора на любом этапе работы с информацией)."
"Однофакторная или слабая проверка доступа" : "использование только одного метода. Например, применение только парольного или только биометрического метода."
"Многофакторная или сильная аутентификация" : "использование двух или более методов."
}
